# vsoWidgetPopupGet

## Description
```pascal
PROCEDURE vsoWidgetPopupGet(
				widgetID    : LONGINT;
				index       : LONGINT;
				VAR outId   : STRING;
				VAR outText : STRING);
```

```python

def vs.vsoWidgetPopupGet(widgetID, index):
    return (outId, outText)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|index|LONGINT||
|outId|STRING||
|outText|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events